practice-for-ch-react-pokedex-rails-backend-long-practice-main/pokedex-rails-backend/app/views/api/pokemon/show.json.jbuilder

SELECT "moves"."name" FROM "moves" INNER JOIN "poke_moves" ON "moves"."id" = "poke_moves"."move_id" WHERE "poke_moves"."pokemon_id" = $1  [["pokemon_id", 1]]
---
moves = @pokemon.moves.pluck(:name)