practice-for-ch-react-pokedex-rails-backend-long-practice-main/pokedex-rails-backend/app/controllers/api/pokemon_controller.rb

INSERT INTO "pokemons" ("number", "name", "attack", "defense", "poke_type", "image_url", "captured", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
        @pokemon = Pokemon.new(pokemon_params)
        if @pokemon.save